'Ст. и ветви, если последние имеются членистые; л. без зеленой окраски срастаются в зубчатое наверху влг., расположенное у основания '
'междоузлия'  : {'Сем. Equisetaceae Rich, Хвощевые'}
'Ст. и ветви не членистые, если членистые, то л. зеленые или буроватые и не срастаются во влг., или л. нет' : {
    'Р. размножаются спорами, не образуют цв., пл. и с.': {
        'Л. черешковые, спорангии или сорусы (скопления спорангиев) расположены на нижней стороне л. или на видоизмененном л.': {
            ' Р. развивают 1, редко 2 л., пластинки которых разделены на стерильную и спороносную части, в молодом состоянии л. улиткообразно не скручен'
             : {'Сем. Ophioglossaceae (R. Br.) Agardh — Ужовниковые'}
            ' Р. развивают более 2 л., пластинки которых не делятся на стерильную и спороносную части; спорангии могут возникать на любом л. или на '
            'видоизмененном; молодые л. улиткообразно скрученные' : {'Сем. Polypodiaceae Bercht. et J. Presl — Многоножковые '}
    'Р. размножаются с, образуют цв. и пл. или сухие, или ягодообразные шишки' : {
        ' Л. игловидные, четырехгранные или плоские, спирально расположенные на удлиненных и пучками на укоро ченных побегах; цв. и пл. не образуются; '
        'с. крылатые или бескрылые, развиваются в пазухах семенных чеш. деревянистых или мясистых (ягодообразных) шишек' : {
            'Семенные шишки деревянистые; с. крылатые или бескрылые' : {'Сем. Pinaceae Lindl. — Сосновые'}
        'Л. сидячие, спорангии находятся в пазухах л. или образуют верхушечные клс. (стробилы)' :
